ReadMe.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-12 五 16:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>FT and FFT Algorithms on Various Number Fields</title>
<meta name="author" content="Master" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">FT and FFT Algorithms on Various Number Fields</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgee9f2f0">1. Introduction:</a></li>
<li><a href="#org0067a6d">2. About the FFT</a>
<ul>
<li><a href="#org65f5622">2.1. Presumptions:</a></li>
<li><a href="#org56ef696">2.2. The FFT Steps:</a></li>
</ul>
</li>
<li><a href="#orgeaa505f">3. About the fields</a>
<ul>
<li><a href="#org7509a16">3.1. Fields in the code</a></li>
<li><a href="#org2000a68">3.2. Field properties as C++ template singleton classes</a></li>
</ul>
</li>
<li><a href="#orgdc996a6">4. Author and Copyright</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgee9f2f0" class="outline-2">
<h2 id="orgee9f2f0"><span class="section-number-2">1.</span> Introduction:</h2>
<div class="outline-text-2" id="text-1">
<p>
A C++ project for the illustration of the Fourier Transformations(FT) and Fast Fourier Transformations(FFT) on different number fields, with the inverse transformations presented, primarily on the complex-number and prime-modular fields.
</p>
</div>
</div>
<div id="outline-container-org0067a6d" class="outline-2">
<h2 id="org0067a6d"><span class="section-number-2">2.</span> About the FFT</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org65f5622" class="outline-3">
<h3 id="org65f5622"><span class="section-number-3">2.1.</span> Presumptions:</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Inputs: \( x = x(0), x(1) ... x(N - 1) \) <b>where \( N = 2^n \)</b></li>
<li>Outputs: \( y = y(0), y(1) ... y(N - 1) \)</li>
<li>The cyclic generator of order	\( N \): \( \phi: \phi^N = 1 \) where in the complex field: \( \phi = \exp(-2\pi i / N) \). Since <b>in any field</b>: \[ 0 = \phi^N - 1 = (\phi^{\frac{N}{2}} + 1)(\phi^{\frac{N}{2}} - 1) \] which proves that <span class="underline">\( \phi^{\frac{N}{2}} = -1 \)</span></li>
<li>Formula:
\[ y = \Phi x \]
i.e.
\[ y(s) = \sum_t \phi^{st} x(t) \]</li>
</ul>
</div>
</div>
<div id="outline-container-org56ef696" class="outline-3">
<h3 id="org56ef696"><span class="section-number-3">2.2.</span> The FFT Steps:</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The original Fourier transformation for the input \( x \) can be <span class="underline">split into the sum of the even and odd items</span>:
\[ y(s) = \sum_{\tau} \phi^{2\tau \cdot s}x(2\tau)  + \sum_{\tau} \phi^{(2\tau + 1) \cdot s} x(2\tau + 1)\]
</p>

<p>
When \( N \) is even, \( (\phi^2)^{N/2} = 1 \). Assume that the partial Fourier Transformation of all the <b>even</b> items are calculated with the cyclic generator \( \phi^2 \):
\[ y_0(s) = \sum_{\tau} \phi^{2\tau \cdot s} x(2\tau) \]
</p>

<p>
Likewisely, assume that the Fourier Transform of all the <b>odd</b> items are calculated with the cyclic generator \( \phi^2 \):
\[ y_1(s) = \sum_{\tau} \phi^{2\tau \cdot s} x(2\tau + 1)\]
</p>

<p>
Then, when \( N \) is even, for any \( s < N/2 \):
\[ y(s) = y_0(s) + \phi^s y_1(s) \]
\[ y(s + \frac{N}{2}) = y_0(s) - \phi^s y_1(s)  \]
</p>

<p>
The consumption for the items of \( y \) is \( O(N) \) <span class="underline">rather than \( O(N^2) \)</span>.
</p>

<p>
The partial transformations \( y_0(s) \) and \( y_1(s) \) can be calculated recursively in further steps, given that <span class="underline">\( N/2 \) is still even</span> before reaching \( 1 \).
</p>

<p>
Totally \( O(\log_2 N) \) recursive steps are required to get the final transformation, so the total calculation is \( N\log_2N \), which still prevails \( O(N^2) \)
</p>
</div>
</div>
</div>
<div id="outline-container-orgeaa505f" class="outline-2">
<h2 id="orgeaa505f"><span class="section-number-2">3.</span> About the fields</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org7509a16" class="outline-3">
<h3 id="org7509a16"><span class="section-number-3">3.1.</span> Fields in the code</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>Complex field: The cyclic generator is \( \phi = \exp(-2\pi i / N) \).</li>
<li>Prime Modular Field: When \( p \) is prime, its modular finite Field is of size \( p - 1 \).
If \( p = q \cdot 2^k + 1 \), the field will have a cyclic sub-group of size \( 2^k \).</li>
</ul>
</div>
</div>
<div id="outline-container-org2000a68" class="outline-3">
<h3 id="org2000a68"><span class="section-number-3">3.2.</span> Field properties as C++ template singleton classes</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Assuming that the field is presented by the C++ datatype <code>F</code>, The <code>Field&lt;F&gt;</code> privides basic field properties:
</p>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #ffffff;">static</span> <span style="color: #7fffd4;">F</span> <span style="color: #40e0d0;">Field</span>&lt;<span style="color: #7fffd4;">F</span>&gt;::<span style="color: #9acd32;">one</span>;  <span style="color: #00cd66;">// </span><span style="color: #00cd66;">1+0i for complex field.
</span><span style="color: #ffffff;">static</span> <span style="color: #7fffd4;">F</span> <span style="color: #40e0d0;">Field</span>&lt;<span style="color: #7fffd4;">F</span>&gt;::<span style="color: #9acd32;">zero</span>; <span style="color: #00cd66;">// </span><span style="color: #00cd66;">0+0i for complex field.
</span>
 <span style="color: #00cd66;">// </span><span style="color: #00cd66;">Returns the len-order cyclic generator. len should be a power of 2 
</span><span style="color: #7fffd4;">F</span> <span style="color: #40e0d0;">Field</span>&lt;<span style="color: #7fffd4;">F</span>&gt;::<span style="color: #98fb98;">get_phi</span>(<span style="color: #7fffd4;">Int</span> <span style="color: #9acd32;">len</span>); 
</pre>
</div>
<p>
The data <code>F</code> should be applicated with <code>operators +, -, *, /, ostream&lt;&lt;</code>
</p>

<p>
Transformation classes, i/o-puts, test data and functions:
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #ffffff;">class</span> <span style="color: #7fffd4;">FT</span>&lt;<span style="color: #7fffd4;">F</span>&gt; { <span style="color: #00cd66;">// </span><span style="color: #00cd66;">Plain Fourier transformaitons
</span>  <span style="color: #7fffd4;">vector</span>&lt;<span style="color: #7fffd4;">F</span>&gt; <span style="color: #9acd32;">xs</span>; <span style="color: #00cd66;">// </span><span style="color: #00cd66;">Inputs
</span>  <span style="color: #7fffd4;">vector</span>&lt;<span style="color: #7fffd4;">F</span>&gt; <span style="color: #9acd32;">ys</span>; <span style="color: #00cd66;">// </span><span style="color: #00cd66;">Outputs
</span>  <span style="color: #7fffd4;">void</span> <span style="color: #98fb98;">trans</span>(); <span style="color: #00cd66;">// </span><span style="color: #00cd66;">Fill the outputs
</span>};

<span style="color: #ffffff;">class</span> <span style="color: #7fffd4;">FFT</span>&lt;<span style="color: #7fffd4;">F</span>&gt; : <span style="color: #ffffff;">public</span> <span style="color: #7fffd4;">FT</span>&lt;<span style="color: #7fffd4;">F</span>&gt; { <span style="color: #00cd66;">// </span><span style="color: #00cd66;">Fast FT
</span>  <span style="color: #ffffff;">override</span> <span style="color: #7fffd4;">void</span> trans();
  <span style="color: #00cd66;">// </span><span style="color: #00cd66;">which requires the recursive function below, 
</span>  <span style="color: #00cd66;">// </span><span style="color: #00cd66;">getting the partial sum of input xs from `start` by `step` of length `length`, transformed with parameter `phiPow`.
</span>  <span style="color: #00cd66;">// </span><span style="color: #00cd66;">Before writing the result to `result`, the outcome of further recursions should be written to `cache` first. 
</span>  <span style="color: #ffffff;">static</span> <span style="color: #7fffd4;">void</span> <span style="color: #98fb98;">branchSum</span>(<span style="color: #7fffd4;">F</span>* <span style="color: #9acd32;">start</span>, <span style="color: #7fffd4;">Int</span> <span style="color: #9acd32;">step</span>, <span style="color: #7fffd4;">Int</span> <span style="color: #9acd32;">length</span>, <span style="color: #7fffd4;">F</span> <span style="color: #9acd32;">phiPow</span>, <span style="color: #7fffd4;">F</span>* <span style="color: #9acd32;">result</span>, <span style="color: #7fffd4;">F</span>* <span style="color: #9acd32;">cache</span>);
  <span style="color: #ffffff;">static</span> <span style="color: #7fffd4;">vector</span>&lt;<span style="color: #7fffd4;">F</span>&gt; <span style="color: #9acd32;">testInput</span>; <span style="color: #00cd66;">// </span><span style="color: #00cd66;">Input used by the test()
</span>  <span style="color: #ffffff;">static</span> <span style="color: #7fffd4;">void</span> <span style="color: #98fb98;">test</span>();
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgdc996a6" class="outline-2">
<h2 id="orgdc996a6"><span class="section-number-2">4.</span> Author and Copyright</h2>
<div class="outline-text-2" id="text-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Author</td>
<td class="org-left">Linghuei Guo</td>
</tr>

<tr>
<td class="org-left">Email</td>
<td class="org-left">guolh2013@hotmail.com</td>
</tr>

<tr>
<td class="org-left">PGP</td>
<td class="org-left">6819D81B0971C2C4</td>
</tr>

<tr>
<td class="org-left">Permission</td>
<td class="org-left">All Rights Reserved</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</body>
</html>
